---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsComponentConnection
source: html/e4804430-f8f5-0985-2c09-5b633c2cd410.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection

Represents information about a connection among stairs components(run to landing).

## Syntax (C#)
```csharp
public class StairsComponentConnection : IDisposable
```